// Задача 42: Напишите программу, которая будет преобразовывать десятичное число в двоичное.
// 45 -> 101101
// 3 -> 11
// 2 -> 10

int value = 45;
string BinaryCode = Convert.ToString(value, 2);
Console.WriteLine(BinaryCode);

